{"pageProps":{"articles":[{"title":"What is a Sitemap and How It Can Be Useful for Your Next.js Websites","link":"https://medium.com/hyperjump-tech/what-is-a-sitemap-and-how-it-can-be-useful-for-your-next-js-websites-97a3e3c02179?source=rss----fabfd42372dc---4","guid":"https://medium.com/p/97a3e3c02179","category":["nextjs-tutorial","sitemap","nextjs","neo-sense","web-development"],"dc:creator":"Denny Pradipta","pubDate":"Fri, 01 Sep 2023 08:12:01 GMT","atom:updated":"2023-09-01T08:12:01.028Z","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*U-xj-m8LD7PGds9n\" /></figure><p>If you’re familiar with web development, you’ve likely encountered <a href=\"https://nextjs.org/?utm_source=hyperjump\">Next.js</a>. It’s a powerful tool for building modern websites. But regardless of the platform or framework, one fundamental component remains crucial: <strong>the sitemap</strong>.</p><h3>What is a Sitemap?</h3><p>Ever picked up a book and flipped to the index page to find a specific topic? That index page, which guides you through the book, is quite similar to what a sitemap does for websites. A sitemap is essentially a file that lists all the web pages of your site, making it visible and accessible to both search engines and users. It’s like a roadmap, guiding users and search engines through the various pages of your website.</p><p>There are two main types of sitemaps:</p><ul><li><strong>XML Sitemaps</strong>: These are tailored for search engines. They’re not just a list of pages but also provide additional information, like when a page was last updated, its importance relative to other pages, and how often it changes. This type of sitemap is crucial for SEO, helping search engines crawl and index the site more efficiently.</li><li><strong>HTML Sitemaps</strong>: Designed for human visitors, these sitemaps offer a visual representation of the website’s structure. It’s essentially a page on your site that lists all other pages, helping visitors find what they’re looking for.</li></ul><h3>Why Sitemaps are Important</h3><p>Sitemaps serve as a bridge between your website and search engines, ensuring that all your content gets the attention it deserves. Here are some key reasons why sitemaps are essential:</p><ol><li><strong>Improved Search Engine Indexing</strong>: Search engines use web crawlers to explore and index content on the web. A sitemap provides these crawlers with a clear path, ensuring that all your pages are discovered and indexed efficiently.</li><li><strong>Faster Content Discovery</strong>: Whenever you add new content or update existing pages, a sitemap helps search engines quickly identify and index these changes, ensuring that your latest content gets in front of your audience faster.</li><li><strong>Better Website Navigation</strong>: For larger websites with many pages, a sitemap helps users find the information they’re looking for, enhancing the overall user experience.</li><li><strong>Prioritizing Content</strong>: Sitemaps allow website owners to specify the importance of each page relative to others. This can guide search engines in understanding which pages are more critical and should be indexed more frequently.</li><li><strong>Identifying Issues</strong>: A sitemap can help website owners detect and rectify issues like broken links or orphaned pages, ensuring the site remains in optimal health.</li><li><strong>Enhanced SEO</strong>: A well-structured sitemap can boost your website’s SEO by ensuring that search engines can access and index all relevant content, leading to better rankings in search results.</li></ol><p>In essence, a sitemap acts as a roadmap for your website, guiding both users and search engines to the content they’re seeking. It’s a simple yet powerful tool that can significantly impact your website’s performance and visibility.</p><h3>Generate Sitemaps for your Next.js Websites</h3><p>To generate sitemaps for your Next.js website, the <a href=\"https://www.npmjs.com/package/next-sitemap\">next-sitemap</a> package offers a simple and efficient solution. Here’s how to set it up:</p><p><strong>1. Installation</strong>: Install the package using npm or yarn:</p><pre>npm i next-sitemap</pre><p><strong>2. Create a Configuration File</strong>: Create a basic configuration file named <strong>next-sitemap.config.js</strong> in your project root. This file will contain settings for your sitemap generation.</p><pre>/** @type {import('next-sitemap').IConfig} */ module.exports = { siteUrl: process.env.SITE_URL || 'https://example.com', generateRobotsTxt: true, // optional // ...other options }</pre><p><strong>3. Building the Sitemaps</strong>: Add <a href=\"https://www.npmjs.com/package/next-sitemap\">next-sitemap</a> as a post-build script in your <strong>package.json</strong>:</p><pre>{ \"build\": \"next build\", \"postbuild\": \"next-sitemap\" }</pre><p><strong>4. Additional Configuration Options</strong>: The <a href=\"https://www.npmjs.com/package/next-sitemap\">next-sitemap</a> package offers a range of configuration options, including setting change frequencies, and priorities, excluding specific paths, and more. You can refer to the <a href=\"https://github.com/iamvishnusankar/next-sitemap#readme\"><strong>official documentation</strong></a> for a comprehensive list of options and their descriptions.</p><p>With these steps, you’ll have a dynamically generated sitemap for your Next.js website every time you build your Next.js project, ensuring better visibility and indexing by search engines.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*_ihzEdw14g7GvD8k.png\" /></figure><h3>Monitoring Next.js Sitemaps using NEO Sense</h3><p>Once you’ve generated your sitemap for your Next.js website, it’s essential to monitor it to ensure that all the pages are accessible and functioning correctly. <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> provides an efficient way to keep an eye on your sitemap.</p><p><a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> is a monitoring service that checks if websites and APIs are running smoothly. If there’s a problem, like your site going down or an API not responding, <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> will let you know right away. You can get these alerts on different platforms, including Telegram and Slack.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*8e0zF9fe656khi5d.png\" /></figure><p>It’s a simple tool that helps make sure everything online is working as it should, which is especially useful when we’re diving into topics like monitoring sitemaps in Next.js. Here’s how to set up a sitemap monitoring using <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a>:</p><h3>1. Sign Up with NEO Sense</h3><p>If you haven’t already, <a href=\"https://neosense.bgnlab.id/register\"><strong>register for a free account</strong></a> on <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a>.</p><h3>2. Import your Sitemap</h3><p>To start monitoring with <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a>, you need to import your sitemap. <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> provides two methods for this: you can upload the sitemap file directly, or you can use the <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> sitemap API. Let’s look at both options:</p><h4>a. Using the File Uploader</h4><ul><li><strong>Download Your Generated Sitemap</strong>: Ensure you have the sitemap you generated for your Next.js website.</li><li><strong>Go to Your Project Page</strong>: Navigate to the main dashboard of <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> and select your project.</li><li><strong>Click the ‘Add New Probe’ Button</strong>: This will allow you to add a new monitoring probe for your sitemap.</li><li><strong>Go to the ‘Import’ Tab</strong>: Here, you’ll find options to import various configurations.</li><li><strong>Select a Sitemap</strong>: Choose the option to select your sitemap and then upload the sitemap XML file you generated earlier.</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/403/0*rC2Sygx6ZvmQPOrL.png\" /></figure><ul><li><strong>Wait for the Import</strong>: <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> will process the sitemap and set up monitoring for all the URLs listed in it. Once it’s done, you’re all set!</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*7Te2ikSdscBYp1QB.png\" /></figure><h4>b. Using the NEO Sense Sitemap API</h4><ul><li><strong>Go to the Dashboard Page</strong>: Navigate to the main dashboard of <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a>. Click on your profile picture located at the top right corner. From the dropdown menu, select “Account.”</li><li><strong>Generate a New Key</strong>: If you haven’t generated an API Key before, you’ll see an option to do so. Click on the “Generate New Key” button.</li><li><strong>Fill Out the API Key Name</strong>: Giving your API key a name can be helpful, especially if you plan on creating multiple keys. This way, you can easily identify the purpose of each key.</li><li><strong>Copy the API Key</strong>: Once generated, make sure to copy the API key and store it in a safe place. Remember, this key won’t be shown again for security reasons, so it’s essential to keep a copy.</li><li><strong>Click the ‘Add New Probe’ Button</strong>: On the main dashboard, find and click on the “Add New Probe” button. This action allows you to set up a new monitoring probe for your sitemap or any other web asset.</li><li><strong>Go to the ‘API’ Tab</strong>: Within the probe setup, navigate to the “API” tab. This section provides options for importing configurations and setting up monitoring using the API.</li><li><strong>Copy the cURL Request</strong>: In the “API” tab, you’ll find a cURL request that’s pre-filled with your details. Copy this request and fill out the missing fields. You can use this cURL command to interact with <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a>’s API, allowing for automated setups or integrations with other tools.</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/405/0*V8IGYWnaAK-512Vo.png\" /></figure><h3>3. Configure Monitoring Settings</h3><ul><li><strong>Notification Channels</strong>: Choose where you’d like to receive notifications. <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> supports channels like Telegram, Slack, and more.</li><li><strong>Alert Conditions</strong>: Set conditions for when you’d like to be alerted, such as if a page in the sitemap returns an error.</li></ul><h3>4. Stay Updated</h3><p>With <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> actively monitoring your sitemap, you’ll get notifications if there’s an issue. This ensures you can quickly address any problems, keeping your website running smoothly.</p><p><strong>Congratulations! </strong>You have successfully created your Next.js website’s sitemap and also monitored it using <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a>!</p><h3>Summary</h3><p>Simply put, a sitemap is a list of all the pages on a website, acting as a guide for both users and search engines. Its importance can’t be understated; sitemaps improve search engine indexing, speed up content discovery, and enhance overall website navigation.</p><p>For those using Next.js, generating a sitemap is made easy with tools like the <a href=\"https://www.npmjs.com/package/next-sitemap\">next-sitemap</a> package. However, creating a sitemap is just one part of the equation. Monitoring it is equally crucial.</p><p><a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> offers a practical solution for this, allowing users to keep tabs on their sitemaps, ensuring everything runs smoothly. By understanding and implementing these concepts, developers can ensure their websites are both user-friendly and optimized for search engines.</p><p>Thanks for reading, and we hope you found this information helpful. Until next time!</p><p><a href=\"https://hyperjump.tech/\">Hyperjump</a> is an open-source-first company providing engineering excellence service. We aim to build and commercialize <a href=\"https://github.com/hyperjumptech\">open-source tools</a> to help companies streamline, simplify, and secure the most important aspects of their modern DevOps practices.</p><p><em>Originally published at </em><a href=\"https://hyperjump.substack.com/p/what-is-a-sitemap-and-how-it-can\"><em>https://hyperjump.substack.com</em></a><em>.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=97a3e3c02179\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/hyperjump-tech/what-is-a-sitemap-and-how-it-can-be-useful-for-your-next-js-websites-97a3e3c02179\">What is a Sitemap and How It Can Be Useful for Your Next.js Websites</a> was originally published in <a href=\"https://medium.com/hyperjump-tech\">Hyperjump Tech</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},{"title":"Generate probes in NEO Sense using your XML Sitemap","link":"https://medium.com/hyperjump-tech/generate-probes-in-neo-sense-using-your-xml-sitemap-581faf08ad12?source=rss----fabfd42372dc---4","guid":"https://medium.com/p/581faf08ad12","category":["sitemap","xml","monitoring","neo-sense","software-development"],"dc:creator":"Denny Pradipta","pubDate":"Wed, 29 Mar 2023 01:42:52 GMT","atom:updated":"2023-03-29T01:42:52.784Z","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*ypdLZ8Zw3dX3B9Jf\" /><figcaption>Photo by <a href=\"https://unsplash.com/@pankajpatel?utm_source=medium&utm_medium=referral\">Pankaj Patel</a> on <a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\">Unsplash</a></figcaption></figure><p>In today’s fast-paced digital world, having a website that functions correctly is crucial for any business. However, constantly monitoring your website and its pages can be a daunting task. That’s where synthetic monitoring tools like <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a> come in handy.</p><p>With <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a>, users can create probes to monitor website performance, availability, and response times. In addition, <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a> has a feature that allows users to generate probes using their XML sitemap. In this article, we’ll explore how to generate probes in NEO Sense using your XML sitemap. So, without further ado:</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FQDyW8tJ7zGaVfL5xv5%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FQDyW8tJ7zGaVfL5xv5%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2FQDyW8tJ7zGaVfL5xv5%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"244\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/4c1094696bfbd083be35184954b86fb5/href\">https://medium.com/media/4c1094696bfbd083be35184954b86fb5/href</a></iframe><p><a href=\"https://neosense.hyperjump.tech\">Website Uptime Monitoring Service & Free Status Pages - Neosense</a></p><p>Meet <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a><strong>: </strong>The web application version of <a href=\"https://monika.hyperjump.tech/\">Monika</a>. It simplifies the use of Monika through an easy-to-use dashboard interface. It provides a graphical user interface to create probes, set alerts and notifications, and check the validity of your TLS/SSL certificates.</p><p>Using <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a>, you can probe your websites and endpoints from multiple locations. Below is the list of available locations currently:</p><ul><li>Jakarta, Indonesia</li><li>Banten, Indonesia</li><li>West Java, Indonesia</li><li>Singapore, Singapore</li><li>Tokyo, Japan</li><li>New Jersey, United States</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*2Fwzdsp_sYJUVqYV.png\" /></figure><p>You can start using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a> by navigating to <a href=\"https://neosense.bgnlab.id/\">https://neosense.bgnlab.id</a> and creating an account. You will receive an email to confirm your account.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/546/0*cqdB6VUc_ZPk90qK.png\" /></figure><p>After confirming your email, log in to the website, and you will be redirected to the <strong>Create Organization</strong> page. Fill out the organization details and click <strong>Create</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*WI3oBGt9YQBKxP4p.png\" /></figure><p>You will be redirected to the <strong>Create Project </strong>page. Set your first project name, and select your time zone. By default, it will automatically use your current time zone. Click <strong>Continue </strong>to go to the dashboard.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*ZGqECPOBuQfEUQp4.png\" /></figure><p>Let’s assume that you already have an XML Sitemap from your website. As an example, we will be using <a href=\"https://monika.hyperjump.tech/sitemap.xml\">the Monika website’s sitemap</a>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/871/1*ZvEW3GRl9PnPSQEeNuWuoQ.png\" /><figcaption>Example sitemap</figcaption></figure><p>After we have our XML sitemap file, go to your project page. Click the caret icon beside the “Import Monika button” and click “<strong>Upload Sitemap File</strong>”. Then, select your XML sitemap file.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/461/1*H7UNoAPrXufY_hk1VqTcWw.png\" /><figcaption>Upload sitemap file</figcaption></figure><p>Wait for the upload process. Once it’s done, your projects page should have new probes generated from your XML sitemap file. From there, you can assign locations, modify alerts, and do whatever you want with your newly created probes just like your other probes.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*MyKryD0RXmimKAYotZDY3Q.png\" /><figcaption>Generated probes from sitemap</figcaption></figure><p>Congratulations! Now you can use your existing XML sitemap file in NEO Sense!</p><h3>Closing</h3><p>In conclusion, generating probes in <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> using an XML sitemap is a convenient and efficient way to monitor your website’s performance. By automating the process of creating probes, you can save time and ensure that all pages on your site are being monitored regularly.</p><p>If you have questions or find issues while using <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a>, don’t hesitate to create an issue on <a href=\"https://github.com/hyperjumptech/monika/issues\">Monika’s Github Issue Page</a>. If you like this article, don’t forget to clap and share this article with your friends!</p><p>Thank you for reading, and we’ll see you next time!</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FzDpYQooxkwXkAWMxRK%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FzDpYQooxkwXkAWMxRK%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2FzDpYQooxkwXkAWMxRK%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"186\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/b8cd9a4b3dd91b94239fe1ec3cb02c23/href\">https://medium.com/media/b8cd9a4b3dd91b94239fe1ec3cb02c23/href</a></iframe><p><a href=\"https://hyperjump.tech/\">Hyperjump</a> is an open-source-first company providing engineering excellence service. We aim to build and commercialize <a href=\"https://github.com/hyperjumptech\">open-source tools</a> to help companies streamline, simplify, and secure the most important aspects of their modern DevOps practices.</p><p><a href=\"https://github.com/hyperjumptech\">Hyperjump</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=581faf08ad12\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/hyperjump-tech/generate-probes-in-neo-sense-using-your-xml-sitemap-581faf08ad12\">Generate probes in NEO Sense using your XML Sitemap</a> was originally published in <a href=\"https://medium.com/hyperjump-tech\">Hyperjump Tech</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},{"title":"Use your Insomnia Collection in NEO Sense","link":"https://medium.com/hyperjump-tech/use-your-insomnia-collection-in-neo-sense-fa71747b9008?source=rss----fabfd42372dc---4","guid":"https://medium.com/p/fa71747b9008","category":["monika","neo-sense","javascript","insomnia","software-development"],"dc:creator":"Denny Pradipta","pubDate":"Wed, 15 Mar 2023 00:24:30 GMT","atom:updated":"2023-03-15T00:24:30.146Z","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*_ahOWMMbT0OyQNZ0\" /><figcaption>Photo by <a href=\"https://unsplash.com/@douglasamarelo?utm_source=medium&utm_medium=referral\">Douglas Lopes</a> on <a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\">Unsplash</a></figcaption></figure><p>If you’re involved in developing and testing APIs, then you’ve probably used <a href=\"https://insomnia.rest/\">Insomnia</a> at some point. <a href=\"https://insomnia.rest/\">Insomnia</a> is a powerful open-source tool that makes it easy to create and test API requests. But what happens when you need to monitor those APIs over time? That’s where <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a> comes in.</p><p>In this article, we’ll explore how to use the Insomnia collection feature in <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a> and the benefits it provides for API monitoring. Whether you’re a developer who’s new to <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a> or an experienced user looking to improve your workflow, this feature is sure to be a game-changer for your API monitoring needs. So without further ado:</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FsmEkbD9LQKfEVvQq17%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FsmEkbD9LQKfEVvQq17%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2FsmEkbD9LQKfEVvQq17%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"237\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/52cbdc68ef7d483ba2099b9e7779a959/href\">https://medium.com/media/52cbdc68ef7d483ba2099b9e7779a959/href</a></iframe><p><a href=\"https://neosense.hyperjump.tech\">Website Uptime Monitoring Service & Free Status Pages - Neosense</a></p><p>Meet <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a><strong>: </strong>The web application version of <a href=\"https://monika.hyperjump.tech/\">Monika</a>. It simplifies the use of Monika through an easy-to-use dashboard interface. It provides a graphical user interface for you to create probes, set alerts and notifications, and check the validity of your TLS/SSL certificates.</p><p>Using <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a>, you can probe your websites and endpoints from multiple locations. Below is the list of available locations currently:</p><ul><li>Jakarta, Indonesia</li><li>Banten, Indonesia</li><li>West Java, Indonesia</li><li>Singapore, Singapore</li><li>Tokyo, Japan</li><li>New Jersey, United States</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*dRKqDYWsbgL0arCa.png\" /></figure><p>You can start using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a> by navigating to <a href=\"https://neosense.bgnlab.id/\">https://neosense.bgnlab.id</a> and creating an account. You will receive an email to confirm your account.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/546/0*DNQju9O80rdogcCd.png\" /></figure><p>After confirming your email, log in to the website, and you will be redirected to the <strong>Create Organization</strong> page. Fill out the organization details and click <strong>Create</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*yvwx3k_9pgxjRdzR.png\" /></figure><p>You will be redirected to the <strong>Create Project </strong>page. Set your first project name, and select your time zone. By default, it will automatically use your current time zone. Click <strong>Continue </strong>to go to the dashboard.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*C41XRWmeqIOkONWA.png\" /></figure><p>Let’s assume that you already have a simple Insomnia collection called <strong>My Collection</strong>. To use it with NEO Sense, export the collection first. Hover over your collection name, click it, and click <strong>Import/Export</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*16zZ-aVRxIk6lyRI_jVnzQ.png\" /></figure><p>Then, click the <strong>Export Data </strong>button and select the <strong>Export the “My Collection” Collection </strong>option. Proceed by selecting the requests you want to export, then select the <strong>Insomnia v4 (YML)</strong> format. After that, save the collection to a directory you prefer.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*wX_LtwX3UV2kDNcyi9B5LA.png\" /></figure><p>Once you have your exported Postman collection ready, go to your project page. Click the three dots beside the “Import Monika button” and click “<strong>Upload Insomnia collection File</strong>”. Then, select your exported Insomnia collection.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/508/1*VXCjifjjIdDRZQrwsnn0DA.png\" /></figure><p>Wait for the upload process. Once it’s done, your projects page should have new probes generated from your Insomnia collection. From there, you can assign locations, modify alerts, and do whatever you want with your newly created probes just like your other probes.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*l9kV3PmzidlNBVpRE_5IcA.png\" /></figure><p>Congratulations! Now you can use your existing Insomnia collection in NEO Sense!</p><h3><strong>Closing</strong></h3><p>Using Insomnia collections in NEO Sense can be a powerful way to simplify your API testing and monitoring workflow. By importing your existing Insomnia requests into NEO Sense, you can save time and reduce errors when creating probes for your websites and endpoints.</p><p>We hope this guide has helped you understand how to use Insomnia collections in NEO Sense, and we encourage you to try it out for yourself. If you encounter any issues or have questions about using NEO Sense, be sure to check out Monika’s Github Issue Page for assistance.</p><p>If you have questions or find issues while using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>, don’t hesitate to create an issue on <a href=\"https://github.com/hyperjumptech/monika/issues\">Monika’s Github Issue Page</a>. If you like this article, don’t forget to clap and share this article with your friends!</p><p>That’s all for now. Thanks for reading, and we’ll see you next time!</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2F1ccd9l2mnpOQz96MZM%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2F1ccd9l2mnpOQz96MZM%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2F1ccd9l2mnpOQz96MZM%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"348\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/2265579c070646760ea0549966e05720/href\">https://medium.com/media/2265579c070646760ea0549966e05720/href</a></iframe><p><a href=\"https://hyperjump.tech/\">Hyperjump</a> is an open-source-first company providing engineering excellence service. We aim to build and commercialize <a href=\"https://github.com/hyperjumptech\">open-source tools</a> to help companies streamline, simplify, and secure the most important aspects of their modern DevOps practices.</p><p><a href=\"https://github.com/hyperjumptech\">Hyperjump</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=fa71747b9008\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/hyperjump-tech/use-your-insomnia-collection-in-neo-sense-fa71747b9008\">Use your Insomnia Collection in NEO Sense</a> was originally published in <a href=\"https://medium.com/hyperjump-tech\">Hyperjump Tech</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},{"title":"Use your Postman collection in NEO Sense","link":"https://medium.com/hyperjump-tech/use-your-postman-collection-in-neo-sense-db00c9137c41?source=rss----fabfd42372dc---4","guid":"https://medium.com/p/db00c9137c41","category":["postman","software-development","neo-sense","monika","javascript"],"dc:creator":"Denny Pradipta","pubDate":"Wed, 08 Mar 2023 00:34:55 GMT","atom:updated":"2023-03-08T00:34:55.108Z","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*Vhcg9yoBVU9N_eqb\" /><figcaption>Photo by <a href=\"https://unsplash.com/@rubaitulazad?utm_source=medium&utm_medium=referral\">Rubaitul Azad</a> on <a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\">Unsplash</a></figcaption></figure><p>If you’re a developer who works with APIs, you’re probably familiar with <a href=\"https://www.postman.com/\">Postman</a>. <a href=\"https://www.postman.com/\">Postman</a> is a popular tool used for API testing and development, allowing you to create and test API requests easily. But what if you could take the API tests you’ve already created in Postman and use them in another tool, like <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a>?</p><p>With <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a>’s feature to import Postman collections, you can do just that. In this article, we’ll show you how to use your Postman collections in <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a>, allowing you to simplify your API monitoring and testing workflow. So, without further ado:</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FiopxsZtW2QVRs4poEC%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FiopxsZtW2QVRs4poEC%2Fgiphy.gif&image=https%3A%2F%2Fmedia0.giphy.com%2Fmedia%2Fv1.Y2lkPTc5MGI3NjExa2JjejQ1Nzl6cXBldTZ4MmtxcmN2eG43aXUyY3Z5Y2ppMnN4bXM4dyZlcD12MV9naWZzX2dpZklkJmN0PWc%2FiopxsZtW2QVRs4poEC%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"246\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/922127e2043692bdf3a0c2717d024c9e/href\">https://medium.com/media/922127e2043692bdf3a0c2717d024c9e/href</a></iframe><p><a href=\"https://neosense.hyperjump.tech\">Website Uptime Monitoring Service & Free Status Pages - Neosense</a></p><p>Meet <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a><strong>: </strong>The web application version of <a href=\"https://monika.hyperjump.tech/\">Monika</a>. It simplifies the use of Monika through an easy-to-use dashboard interface. It provides a graphical user interface for you to create probes, set alerts and notifications, and check the validity of your TLS/SSL certificates.</p><p>Using <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a>, you can probe your websites and endpoints from multiple locations. Below is the list of available locations currently:</p><ul><li>Jakarta, Indonesia</li><li>Banten, Indonesia</li><li>West Java, Indonesia</li><li>Singapore, Singapore</li><li>Tokyo, Japan</li><li>New Jersey, United States</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*kAX8kg0oD6p7RzTw.png\" /></figure><p>You can start using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a> by navigating to <a href=\"https://neosense.bgnlab.id/\">https://neosense.bgnlab.id</a> and creating an account. You will receive an email to confirm your account.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/546/0*YAhN7ShphmPvcnng.png\" /></figure><p>After confirming your email, log in to the website, and you will be redirected to the <strong>Create Organization</strong> page. Fill out the organization details and click <strong>Create</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*KXHUdi8Gm-Kg14Qh.png\" /></figure><p>You will be redirected to the <strong>Create Project </strong>page. Set your first project name, and select your time zone. By default, it will automatically use your current time zone. Click <strong>Continue </strong>to go to the dashboard.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*2QNbh2ezFZcHNP2e.png\" /></figure><p>Let’s assume that you already have a simple Postman collection. To use it with NEO Sense, export the collection first. Hover over your Postman collection, click the three dots icon, and click <strong>Export</strong>. Then, select <strong>Collection v2.1</strong> and save it to your local folder.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/889/1*Y7avLf-0qnVA15r7xa_P9A.png\" /><figcaption>Export the Postman collection</figcaption></figure><p>Once you have your exported Postman collection ready, go to your project page. Click the three dots beside the “Import Monika button” and click “<strong>Upload Postman collection File</strong>”. Then, select your exported Postman collection.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/667/1*5d2-plt0PwYAc9bxruvbSg.png\" /><figcaption>Upload the Postman Collection file</figcaption></figure><p>Wait for the upload process. Once it’s done, your projects page should have new probes generated from your Postman collection. From there, you can assign locations, modify alerts, and do whatever you want with your newly created probes just like your other probes.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*0dlsI_JeZZxqBQBUr1d0pA.png\" /><figcaption>Imported Postman collection.</figcaption></figure><p>Congratulations! Now you can use your existing Postman collection in NEO Sense!</p><h3>Closing</h3><p>Using Postman collections in NEO Sense can be a powerful way to streamline your API testing and monitoring process. By leveraging the work you’ve already done in Postman, you can save time and reduce the likelihood of errors when creating probes in NEO Sense.</p><p>We hope this guide has helped you understand how to use Postman collections in NEO Sense, and we encourage you to give it a try for yourself.</p><p>If you have questions or find issues while using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>, don’t hesitate to create an issue on <a href=\"https://github.com/hyperjumptech/monika/issues\">Monika’s Github Issue Page</a>. If you like this article, don’t forget to clap and share this article with your friends!</p><p>That’s it for today, see you next week!</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2Fl41K4KlVE8dgozf8I%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2Fl41K4KlVE8dgozf8I%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2Fl41K4KlVE8dgozf8I%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"243\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/0f7b2a19730ee96e779d47890a3c7a46/href\">https://medium.com/media/0f7b2a19730ee96e779d47890a3c7a46/href</a></iframe><p><a href=\"https://hyperjump.tech/\">Hyperjump</a> is an open-source-first company providing engineering excellence service. We aim to build and commercialize <a href=\"https://github.com/hyperjumptech\">open-source tools</a> to help companies streamline, simplify, and secure the most important aspects of their modern DevOps practices.</p><p><a href=\"https://github.com/hyperjumptech\">Hyperjump</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=db00c9137c41\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/hyperjump-tech/use-your-postman-collection-in-neo-sense-db00c9137c41\">Use your Postman collection in NEO Sense</a> was originally published in <a href=\"https://medium.com/hyperjump-tech\">Hyperjump Tech</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},{"title":"How to Manage Organization Members in NEO Sense","link":"https://medium.com/hyperjump-tech/how-to-manage-organization-members-in-neo-sense-bce04fafd81e?source=rss----fabfd42372dc---4","guid":"https://medium.com/p/bce04fafd81e","category":["neo-sense","software-development","monitoring","javascript","open-source"],"dc:creator":"Denny Pradipta","pubDate":"Tue, 28 Feb 2023 13:13:24 GMT","atom:updated":"2023-02-28T13:13:24.569Z","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*dBo02jQ17J43Qj6V\" /><figcaption>Photo by <a href=\"https://unsplash.com/@hannahbusing?utm_source=medium&utm_medium=referral\">Hannah Busing</a> on <a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\">Unsplash</a></figcaption></figure><p>If you’re working with a team or multiple organizations, managing members’ access to probes is essential for effective collaboration. <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a> offers a feature to manage organization members, making it easy to add or remove members and control their level of access to your probes.</p><p>In this article, we’ll guide you through the steps of how to manage organization members in <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>, helping you to improve your team’s workflow and boost productivity.</p><p>By following these steps, you’ll be able to streamline your team’s workflow and make collaboration a breeze. So, without further ado:</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2Fy9XCVEKx02Q3tyHSD5%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2Fy9XCVEKx02Q3tyHSD5%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2Fy9XCVEKx02Q3tyHSD5%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"244\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/d06044967b447660f57e8e3bfdb18155/href\">https://medium.com/media/d06044967b447660f57e8e3bfdb18155/href</a></iframe><p><a href=\"https://neosense.hyperjump.tech\">Website Uptime Monitoring Service & Free Status Pages - Neosense</a></p><p>Meet <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a><strong>: </strong>The web application version of <a href=\"https://monika.hyperjump.tech/\">Monika</a>. It simplifies the use of Monika through an easy-to-use dashboard interface. It provides a graphical user interface for you to create probes, set alerts and notifications, and check the validity of your TLS/SSL certificates.</p><p>Using <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a>, you can probe your websites and endpoints from multiple locations. Below is the list of available locations currently:</p><ul><li>Jakarta, Indonesia</li><li>Banten, Indonesia</li><li>West Java, Indonesia</li><li>Singapore, Singapore</li><li>Tokyo, Japan</li><li>New Jersey, United States</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*TahfAyhtG9wr-zIN.png\" /></figure><p>You can start using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a> by navigating to <a href=\"https://neosense.bgnlab.id/\">https://neosense.bgnlab.id</a> and creating an account. You will receive an email to confirm your account.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/546/0*LAAl1IHU2QyrFzPQ.png\" /></figure><p>After confirming your email, log in to the website, and you will be redirected to the <strong>Create Organization</strong> page. Fill out the organization details and click <strong>Create</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*AAGryG7mleOyCSGY.png\" /></figure><p>You will be redirected to the <strong>Create Project </strong>page. Set your first project name, and select your time zone. By default, it will automatically use your current time zone. Click <strong>Continue </strong>to go to the dashboard.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*a8EHwRLUGcElowMQ.png\" /></figure><p>Proceed by clicking your organization name. Then, click the <strong>Members </strong>tab. You will see that your account has the <strong>OWNER</strong> role, assigned to all projects and probes.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*RsjDl3SqJjmlTYn5mlwDRA.png\" /></figure><p>You can add another organization member by clicking the <strong>Add new member</strong> button. Then, fill out the member’s email and set their roles. Each role has limitations, and you can read all of the limitations by clicking on the <strong>More information about this role</strong> link.</p><p>As an example, let’s add a new member with these specifications:</p><ul><li>Assign a <strong>READER</strong> role</li><li>Assign to <strong>My Project </strong>project</li><li>Assign to <strong>Monika </strong>and <strong>TribunNews</strong> probe</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*PAMqOL2M_wvYTi1A7eQYxA.png\" /></figure><p>Once that’s done, click the <strong>Add Member</strong> button. You will see that on the <strong>My Organization</strong> members page there is a new member with the email denny@hyperjump.tech.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*CXv72dgjmyxzt7XGo3VlMA.png\" /></figure><p>If you want to edit the existing members’ roles and assignments, you can just edit them right away by clicking the pencil icon.</p><p>The members added to the project can now see the probes and projects they are assigned to. If by chance a member is not registered yet, they will be sent an email to create an account in <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GTDd0bpQ-Dmepk7k9OaHpg.png\" /></figure><p>Congratulations! Now you can invite your team members to your organizations and assign them to their projects.</p><h3>Closing</h3><p>In conclusion, managing organization members in NEO Sense is a crucial feature for any business or organization that values efficient collaboration and workflow.</p><p>By following the simple steps outlined in this article, you’ll be able to add or remove members and assign custom roles and permissions with ease. This will help you to improve your team’s productivity and ensure that everyone has access to the information they need to get their work done.</p><p>If you have questions or find issues while using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>, don’t hesitate to create an issue on <a href=\"https://github.com/hyperjumptech/monika/issues\">Monika’s Github Issue Page</a>. If you like this article, don’t forget to clap and share this article with your friends!</p><p>That’s it for today, see you next week!</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FBoHCeLmEKytt7oFxyR%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FBoHCeLmEKytt7oFxyR%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2FBoHCeLmEKytt7oFxyR%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"348\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/9439cb96cf2a6120cf2884cba54c7aaa/href\">https://medium.com/media/9439cb96cf2a6120cf2884cba54c7aaa/href</a></iframe><p><a href=\"https://hyperjump.tech/\">Hyperjump</a> is an open-source-first company providing engineering excellence service. We aim to build and commercialize <a href=\"https://github.com/hyperjumptech\">open-source tools</a> to help companies streamline, simplify, and secure the most important aspects of their modern DevOps practices.</p><p><a href=\"https://github.com/hyperjumptech\">Hyperjump</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=bce04fafd81e\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/hyperjump-tech/how-to-manage-organization-members-in-neo-sense-bce04fafd81e\">How to Manage Organization Members in NEO Sense</a> was originally published in <a href=\"https://medium.com/hyperjump-tech\">Hyperjump Tech</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},{"title":"Open-sourcing Ztorage: A Type-Safe Wrapper for Key-Value Storage in JavaScript","link":"https://medium.com/hyperjump-tech/open-sourcing-ztorage-a-type-safe-wrapper-for-key-value-storage-in-javascript-2cfe9879ea1a?source=rss----fabfd42372dc---4","guid":"https://medium.com/p/2cfe9879ea1a","category":["database","open-source","javascript","web-development","nodejs"],"dc:creator":"Kevin Hermawan","pubDate":"Mon, 20 Feb 2023 08:16:12 GMT","atom:updated":"2023-02-20T09:07:12.613Z","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*o2KADItTxdfpg7pWpzNlvw.png\" /><figcaption>Ztorage in Action</figcaption></figure><h3>The Problem</h3><p><a href=\"https://en.wikipedia.org/wiki/Key%E2%80%93value_database\">Key-value storage</a> is a commonly used storage mechanism in web development. As developers, we at Hyperjump have built many websites that require local storage to persist data between sessions. However, we’ve always been restless about the lack of type safety in key-value storage. Bugs can easily slip into our code without the ability to ensure that the stored data conforms to a particular schema, making it difficult to maintain and extend our applications.</p><p>For example, imagine a user setting for a web application that should always be a boolean value. Still, because we’re using a key-value storage system without proper type safety, Hyperjump accidentally stores it as a string. Later on, when we try to retrieve this setting and use it in our application, we may encounter unexpected behavior that’s difficult to debug. This is just one example of the types of issues that can arise without proper type safety, and it’s something that we at Hyperjump and many developers have struggled with for years.</p><p>This is precisely why we at Hyperjump created <a href=\"https://github.com/hyperjumptech/ztorage\">Ztorage</a>: to solve the type-safety problem in key-value storage. With Ztorage, we can define schemas for our data, enabling automatic validation and parsing of stored data to ensure that it conforms to the expected format. By providing robust type safety features, Ztorage makes it easier for us to maintain, extend, and debug our applications.</p><p><a href=\"https://github.com/hyperjumptech/ztorage\">GitHub - hyperjumptech/ztorage: A type-safe wrapper for key-value storage in JavaScript</a></p><h3>Features of Ztorage</h3><h4>Compile-time and runtime validation</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*rvcOhvJZSLu_Sp2AaYhg8Q.png\" /><figcaption>Screenshot showing Ztorage’s compile-time type checking in action</figcaption></figure><p>Ztorage uses the <a href=\"https://github.com/colinhacks/zod\">Zod</a> library to enable compile-time and runtime validation of stored data. When we define a schema for our stored data, we can leverage Zod’s type inference capabilities to generate TypeScript types for our data automatically. This makes it easier to catch errors during the development process since the TypeScript compiler will detect inconsistencies between the defined schema and the stored data.</p><p>At runtime, Zod’s validation capabilities ensure that our stored data is parsed correctly and that any errors are caught and handled appropriately. This combination of compile-time and runtime validation helps ensure that our data is always properly formatted and that any issues are caught early in the development process. This way, we can ensure that our applications are more reliable and less prone to unexpected bugs.</p><h4>Support for various storage mediums</h4><p>Ztorage is a versatile wrapper we at Hyperjump designed to work with various storage systems. It supports popular options like <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Window/localStorage\">localStorage</a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Window/sessionStorage\">sessionStorage</a> and more advanced solutions such as <a href=\"https://github.com/localForage/localForage\">localForage</a> and <a href=\"https://reactnative.dev/docs/asyncstorage\">React Native’s AsyncStorage</a>. This flexibility allows us to use Ztorage across different projects and platforms without worrying about compatibility issues or rewriting code to work with other storage systems.</p><h3>Closing</h3><p>In conclusion, Ztorage, created by us at Hyperjump, is a lightweight and flexible library that provides a simple and type-safe wrapper for key-value storage in our JavaScript applications. By adding support for compile-time and runtime validation, as well as a range of storage mediums, Ztorage makes it easier to ensure that our data is always properly formatted and easy to work with. As an open-source project, Ztorage is constantly evolving, and we look forward to seeing how the community will continue to use and build upon its features in the future.</p><p><a href=\"https://hyperjump.tech/\">Hyperjump</a> is an open-source-first company providing engineering excellence service. We aim to build and commercialize <a href=\"https://github.com/hyperjumptech\">open-source tools</a> to help companies streamline, simplify, and secure the most important aspects of their modern DevOps practices.</p><p><a href=\"https://github.com/hyperjumptech\">Hyperjump</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=2cfe9879ea1a\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/hyperjump-tech/open-sourcing-ztorage-a-type-safe-wrapper-for-key-value-storage-in-javascript-2cfe9879ea1a\">Open-sourcing Ztorage: A Type-Safe Wrapper for Key-Value Storage in JavaScript</a> was originally published in <a href=\"https://medium.com/hyperjump-tech\">Hyperjump Tech</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},{"title":"How to share your Probes’ Status Page in NEO Sense","link":"https://medium.com/hyperjump-tech/how-to-share-your-probes-status-page-in-neo-sense-dadc3be38af1?source=rss----fabfd42372dc---4","guid":"https://medium.com/p/dadc3be38af1","category":["open-source","neo-sense","monitoring","software-development","javascript"],"dc:creator":"Denny Pradipta","pubDate":"Wed, 15 Feb 2023 00:53:34 GMT","atom:updated":"2023-02-15T00:53:34.481Z","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*oT0mdyYXVJp1v2kE\" /><figcaption>Photo by <a href=\"https://unsplash.com/@marvelous?utm_source=medium&utm_medium=referral\">Marvin Meyer</a> on <a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\">Unsplash</a></figcaption></figure><p>Monitoring the performance and status of your websites and APIs is critical for any business, and being able to share this information with others easily is a crucial aspect of this process. In <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a>, the “Share Status Page” feature provides a simple and secure way to share this information with anyone who needs it, whether that’s your team, stakeholders, or clients. This feature is an essential tool for keeping everyone informed and up-to-date on the health of your network.</p><p>In this article, we’ll explore how to take advantage of the “Share Status Page” feature in <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a>, and show you how to enable and set a password for your status page to suit your specific needs. So, without further ado:</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2F3o72F2QGzVubeF8Tsc%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2F3o72F2QGzVubeF8Tsc%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2F3o72F2QGzVubeF8Tsc%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"244\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/ce943eb1878d30db7c76a26296e96205/href\">https://medium.com/media/ce943eb1878d30db7c76a26296e96205/href</a></iframe><p><a href=\"https://neosense.hyperjump.tech\">Website Uptime Monitoring Service & Free Status Pages - Neosense</a></p><p>Meet <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a><strong>: </strong>The web application version of <a href=\"https://monika.hyperjump.tech/\">Monika</a>. It simplifies the use of Monika through an easy-to-use dashboard interface. It provides a graphical user interface to create probes, set alerts and notifications, and check the validity of your TLS/SSL certificates.</p><p>Using <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a>, you can probe your websites and endpoints from multiple locations. Below is the list of available locations currently:</p><ul><li>Jakarta, Indonesia</li><li>Banten, Indonesia</li><li>West Java, Indonesia</li><li>Singapore, Singapore</li><li>Tokyo, Japan</li><li>New Jersey, United States</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*l4SIiLC5nciiZy6Q.png\" /></figure><p>You can start using <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> by navigating to <a href=\"https://neosense.hyperjump.tech\">https://neosense.hyperjump.tech</a> and creating an account. You will receive an email to confirm your account.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/546/0*8QWY6A7V8UNKWquB.png\" /></figure><p>After confirming your email, log in to the website, and you will be redirected to the <strong>Create Organization</strong> page. Fill out the organization details and click <strong>Create</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*ZOQDoL0lmUTiS6fI.png\" /></figure><p>You will be redirected to the <strong>Create Project </strong>page. Set your first project name, and select your time zone. By default, it will automatically use your current time zone. Click <strong>Continue </strong>to go to the dashboard.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*OX1htvclQI-DXXxl.png\" /></figure><p>In the dashboard, click the <strong>Add New Probe</strong> button. Then, fill out the probe details such as probe <strong>protocol</strong> (HTTP/TCP), <strong>name</strong>, <strong>URL</strong>, and <strong>description</strong>. Then, save the probe by clicking the <strong>Add New Probe </strong>button. Remember that to monitor TLS/SSL certificate status, <strong>you need to use HTTPS URL</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*JSpWGYLpgcRtQaEo.png\" /></figure><p>Head to the <strong>Overview</strong> Tab. You will see the <strong>Share Status Page </strong>button on the top right of the page. Click the button and toggle the switch. You can see the URL of the status page and a password box. You can set the status page password so that only certain users can open it or leave it blank if you want to make it public.</p><p>Note that <strong>your status page password cannot be displayed again after you close the Share status page modal</strong>, so make sure you write it down elsewhere.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*R1wfA3uUYo-15_Yg9-s2sw.png\" /></figure><p>Click <strong>Update Password</strong> to save changes. If you want to see the status page URL, you can click the <strong>Share Status Page</strong> button again. Let’s try visiting the status page by copying the URL to the address bar.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*-hNDizHCL439r98P9rEg0g.png\" /></figure><p>If you have set a password, you will be prompted to enter your status page password. If you have not, <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a> will automatically show the page.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*aHtw1bETDqdBnXIeIVhHIw.png\" /></figure><p>Congratulations! Now you can share your probe status page with anyone who has the link (and password)!</p><h3>Closing</h3><p>In conclusion, the “Share Status Page” feature in NEO Sense provides an essential tool for businesses looking to keep their team, stakeholders, and clients informed about the performance and status of their websites and APIs. Whether you want to set a password for added security or leave it for the public, you can share your probes’ status page with anyone who has the link and the password.</p><p>If you have questions or find issues while using <a href=\"https://neosense.bgnlab.id/\">NEO Sense</a>, don’t hesitate to create an issue on <a href=\"https://github.com/hyperjumptech/monika/issues\">Monika’s Github Issue Page</a>. If you like this article, don’t forget to clap and share this article with your friends!</p><p>That’s it for today, see you next week!</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FBLKswIymJeLFS%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FBLKswIymJeLFS%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2FBLKswIymJeLFS%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"254\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/a8be03aee2c749ae8bf71b985f765ac4/href\">https://medium.com/media/a8be03aee2c749ae8bf71b985f765ac4/href</a></iframe><p><a href=\"https://hyperjump.tech/\">Hyperjump</a> is an open-source-first company providing engineering excellence service. We aim to build and commercialize <a href=\"https://github.com/hyperjumptech\">open-source tools</a> to help companies streamline, simplify, and secure the most important aspects of their modern DevOps practices.</p><p><a href=\"https://github.com/hyperjumptech\">Hyperjump</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=dadc3be38af1\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/hyperjump-tech/how-to-share-your-probes-status-page-in-neo-sense-dadc3be38af1\">How to share your Probes’ Status Page in NEO Sense</a> was originally published in <a href=\"https://medium.com/hyperjump-tech\">Hyperjump Tech</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},{"title":"Group Probes by Organizations or Projects in NEO Sense","link":"https://medium.com/hyperjump-tech/group-probes-by-organizations-or-projects-in-neo-sense-668ac659e040?source=rss----fabfd42372dc---4","guid":"https://medium.com/p/668ac659e040","category":["software-development","monitoring","synthetic-monitoring","neo-sense","javascript"],"dc:creator":"Denny Pradipta","pubDate":"Wed, 08 Feb 2023 00:10:31 GMT","atom:updated":"2023-02-08T00:10:31.568Z","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*6epweh6z9ifo-4UZ\" /><figcaption>Photo by <a href=\"https://unsplash.com/@mvdheuvel?utm_source=medium&utm_medium=referral\">Maarten van den Heuvel</a> on <a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\">Unsplash</a></figcaption></figure><p>Businesses must have real-time visibility into the performance and status of their websites and APIs. This is where synthetic monitoring tools like <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a> come in — they provide performance reports of what they need to identify and resolve issues before they become significant problems.</p><p>However, for organizations or projects working with large teams, it’s important to monitor and analyze performance metrics in a more organized and efficient manner. This is where the concept of grouping probes by organizations or projects comes in.</p><p>In this article, we’ll dive into the benefits and applications of grouping probes by organizations or projects in NEO Sense. By the end of this article, you’ll have a better understanding of how grouping probes can help you monitor your websites and APIs more effectively. So, without further ado:</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FKxhJnv1lC00huSdbNO%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FKxhJnv1lC00huSdbNO%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2FKxhJnv1lC00huSdbNO%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"244\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/6697c1ef5731bdb34333edb006e0bb30/href\">https://medium.com/media/6697c1ef5731bdb34333edb006e0bb30/href</a></iframe><p><a href=\"https://neosense.hyperjump.tech\">Website Uptime Monitoring Service & Free Status Pages - Neosense</a></p><p>Meet <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a><strong>: </strong>The web application version of <a href=\"https://monika.hyperjump.tech/\">Monika</a>. It simplifies the use of Monika through an easy-to-use dashboard interface. It provides a graphical user interface for you to create probes, set alerts and notifications, and check the validity of your TLS/SSL certificates.</p><p>Using <a href=\"https://neosense.hyperjump.tech/\"><strong>NEO Sense</strong></a>, you can probe your websites and endpoints from multiple locations. Below is the list of available locations currently:</p><ul><li>Jakarta, Indonesia</li><li>Banten, Indonesia</li><li>West Java, Indonesia</li><li>Singapore, Singapore</li><li>Tokyo, Japan</li><li>New Jersey, United States</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*xUas-xvTN2GTDpOI.png\" /></figure><p>You can start using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a> by navigating to <a href=\"https://neosense.bgnlab.id/\">https://neosense.bgnlab.id</a> and creating an account. You will receive an email to confirm your account.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/546/0*Pah-PnUYpT3IyjK8.png\" /></figure><p>After confirming your email, log in to the website, and you will be redirected to the <strong>Create Organization</strong> page. Fill out the organization details and click <strong>Create</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*2_kzpUTBl0X7nOXo.png\" /></figure><p>You will be redirected to the <strong>Create Project </strong>page. Set your first project name, and select your time zone. By default, it will automatically use your current time zone. Click <strong>Continue </strong>to go to the dashboard.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*nfpGZB18__EEROFF.png\" /></figure><p>In the dashboard, click the <strong>Add New Probe</strong> button. Then, fill out the probe details such as probe <strong>protocol</strong> (HTTP/TCP), <strong>name</strong>, <strong>URL</strong>, and <strong>description</strong>. Then, save the probe by clicking the <strong>Add New Probe </strong>button. Remember that to monitor TLS/SSL certificate status, <strong>you need to use HTTPS URL</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*uPynMmbOIe3To6Ak.png\" /></figure><p>After you created your first probe, you can click your organization name (in my case, <strong>My Organization)</strong> menu on the sidebar. You can create a new project by clicking the <strong>Add New Project</strong> button. Fill out the form, and click <strong>Add New Project</strong> to create your new project. From there, you can create new probes under the newly created project.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*ttbuep9XeWyAW-E01IvEOw.png\" /></figure><p>If you want to create a new organization, click the <strong>New Organization</strong> button on the sidebar. Fill out the form, and click <strong>Add New Organization</strong> button. From there, you can create new projects and probes under the newly created organization.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*jBoxLQ54ly_HmeGgDIkmJQ.png\" /></figure><p>If you want to limit which organizations are visible to certain users, you can navigate to the <strong>Members </strong>tab on the Organization page, and invite the users into the organization.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*iguN93DIplTmica4j3SxTw.png\" /></figure><p>Congratulations, you can now group your probes by project or organization so that you can define a clearer scope for your team!</p><h3>Closing</h3><p>In conclusion, grouping probes by organizations or projects in NEO Sense is a powerful way to monitor and analyze performance metrics for your websites and APIs in a more organized and efficient manner. Whether you’re part of a large team or working solo, the ability to group probes in NEO Sense is a valuable tool that can help you streamline your monitoring process and ensure the best out of your website.</p><p>If you have questions or find issues while using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>, don’t hesitate to create an issue on <a href=\"https://github.com/hyperjumptech/monika/issues\">Monika’s Github Issue Page</a>. If you like this article, don’t forget to clap and share this article with your friends!</p><p>That’s it for today, see you next week!</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2Fl1J3CbFgn5o7DGRuE%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2Fl1J3CbFgn5o7DGRuE%2Fgiphy.gif&image=https%3A%2F%2Fmedia3.giphy.com%2Fmedia%2Fv1.Y2lkPTc5MGI3NjExbG51YTI0ZmU3ZTI1OGx2ZGVjY3h4NmJhYTJjeHFuOGZsOGQ1bTd4eiZlcD12MV9naWZzX2dpZklkJmN0PWc%2Fl1J3CbFgn5o7DGRuE%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"281\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/5fa8f4266a7202d18b96ad7d41b42eef/href\">https://medium.com/media/5fa8f4266a7202d18b96ad7d41b42eef/href</a></iframe><p><a href=\"https://hyperjump.tech/\">Hyperjump</a> is an open-source-first company providing engineering excellence service. We aim to build and commercialize <a href=\"https://github.com/hyperjumptech\">open-source tools</a> to help companies streamline, simplify, and secure the most important aspects of their modern DevOps practices.</p><p><a href=\"https://github.com/hyperjumptech\">Hyperjump</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=668ac659e040\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/hyperjump-tech/group-probes-by-organizations-or-projects-in-neo-sense-668ac659e040\">Group Probes by Organizations or Projects in NEO Sense</a> was originally published in <a href=\"https://medium.com/hyperjump-tech\">Hyperjump Tech</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},{"title":"Configuring Notification Channels in NEO Sense","link":"https://medium.com/hyperjump-tech/configuring-notification-channels-in-neo-sense-8a686befe00a?source=rss----fabfd42372dc---4","guid":"https://medium.com/p/8a686befe00a","category":["javascript","monika","software-development","neo-sense","monitoring"],"dc:creator":"Denny Pradipta","pubDate":"Wed, 01 Feb 2023 01:35:55 GMT","atom:updated":"2023-02-01T01:35:55.084Z","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*G0clojnCnMV6YCG_\" /><figcaption>Photo by <a href=\"https://unsplash.com/@hostreviews?utm_source=medium&utm_medium=referral\">Stephen Phillips - Hostreviews.co.uk</a> on <a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\">Unsplash</a></figcaption></figure><p>So you have created probes in <a href=\"https://neosense.hyperjump.tech\">NEO Sense</a>, great! But have you configured your notifications channels yet? By default, you will receive notifications regarding incidents or recoveries through your registered email. But did you know that there are other notification channels you can utilize?</p><p>In this article, we will take a detailed look at how to configure notification channels in the NEO Sense platform. We will discuss how to add another notification channel to your probes. By the end of this article, you will have a clear understanding of how to use other notification channels besides an email in the NEO Sense. So, without further ado:</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FWGFJAIyTYtn47huJ0x%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FWGFJAIyTYtn47huJ0x%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2FWGFJAIyTYtn47huJ0x%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"244\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/dff5c81f5b47dbcaa49cdb988a5379a6/href\">https://medium.com/media/dff5c81f5b47dbcaa49cdb988a5379a6/href</a></iframe><p><a href=\"https://neosense.hyperjump.tech\">Website Uptime Monitoring Service & Free Status Pages - Neosense</a></p><p>Meet <a href=\"https://neosense.hyperjump.tech\"><strong>NEO Sense</strong></a><strong>: </strong>The web application version of <a href=\"https://monika.hyperjump.tech/\">Monika</a>. It simplifies the use of Monika through an easy-to-use dashboard interface. It provides a graphical user interface for you to create probes, set alerts and notifications, and check the validity of your TLS/SSL certificates.</p><p>Using <a href=\"https://neosense.hyperjump.tech\"><strong>NEO Sense</strong></a>, you can probe your websites and endpoints from multiple locations. Below is the list of available locations currently:</p><ul><li>Jakarta, Indonesia</li><li>Banten, Indonesia</li><li>West Java, Indonesia</li><li>Singapore, Singapore</li><li>Tokyo, Japan</li><li>New Jersey, United States</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*JOwVBdp3zybFPz0w.png\" /></figure><p>You can start using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a> by navigating to <a href=\"https://neosense.bgnlab.id/\">https://neosense.bgnlab.id</a> and creating an account. You will receive an email to confirm your account.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/546/0*iFqx_NHK1Ke--FYt.png\" /></figure><p>After confirming your email, log in to the website, and you will be redirected to the <strong>Create Organization</strong> page. Fill out the organization details and click <strong>Create</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*R141Eug4Q2RGqyzf.png\" /></figure><p>You will be redirected to the <strong>Create Project </strong>page. Set your first project name, and select your time zone. By default, it will automatically use your current time zone. Click <strong>Continue </strong>to go to the dashboard.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*bcPWppPw5vmXBFPK.png\" /></figure><p>In the dashboard, click the <strong>Add New Probe</strong> button. Then, fill out the probe details such as probe <strong>protocol</strong> (HTTP/TCP), <strong>name</strong>, <strong>URL</strong>, and <strong>description</strong>. Then, save the probe by clicking the <strong>Add New Probe </strong>button. Remember that to monitor TLS/SSL certificate status, <strong>you need to use HTTPS URL</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*qehIWhf0TSPXV5eR.png\" /></figure><p>After you created a probe, head to the <strong>Notifications</strong> tab. Here you will see that the default notification channel is email. By default, when there are incidents or recoveries, you will be notified through your registered email.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*XkTPVHs0hBZBrWMLT9uOnA.png\" /></figure><p>To add a new notification channel, click the <strong>Add Notification</strong> button. From there, you can select your preferred notification channel and add the required data. You can also click the link on the right to read how to get the data needed to use the notification channel.</p><p>Once you are done filling out the notification channel form, click the <strong>Add </strong>button. Your notification should be displayed now.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*1C2IVfh0_oJjwshUubgplg.png\" /></figure><p>You can also use your existing notification channels from other probes. So if you have multiple probes, you can click the <strong>Add Existing</strong> button and select the notification channel from your other probe. After you made your decision, click the <strong>Use </strong>button.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/461/1*AnBZApM02qN2Owgvn_XYTA.png\" /></figure><p>Congratulations, you have configured notification channels for your probes in NEO Sense!</p><h3>Closing</h3><p>In conclusion, <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a> is a valuable tool for developers looking to improve the performance of their website for a global audience. You can receive incident or recovery notifications through any preferred notification channel you have configured.</p><p>If you have questions or find issues while using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>, don’t hesitate to create an issue on <a href=\"https://github.com/hyperjumptech/monika/issues\">Monika’s Github Issue Page</a>. If you like this article, don’t forget to clap and share this article with your friends!</p><p>That’s it for today, see you next week!</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FRu9sjtZ09XOEg%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FRu9sjtZ09XOEg%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2FRu9sjtZ09XOEg%2F200.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"243\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/4f476af96bfc121f69ff4ed2f4864a8b/href\">https://medium.com/media/4f476af96bfc121f69ff4ed2f4864a8b/href</a></iframe><p><a href=\"https://hyperjump.tech/\">Hyperjump</a> is an open-source-first company providing engineering excellence service. We aim to build and commercialize <a href=\"https://github.com/hyperjumptech\">open-source tools</a> to help companies streamline, simplify, and secure the most important aspects of their modern DevOps practices.</p><p><a href=\"https://github.com/hyperjumptech\">Hyperjump</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=8a686befe00a\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/hyperjump-tech/configuring-notification-channels-in-neo-sense-8a686befe00a\">Configuring Notification Channels in NEO Sense</a> was originally published in <a href=\"https://medium.com/hyperjump-tech\">Hyperjump Tech</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},{"title":"Get notified of expiring TLS/SSL certificates with NEO Sense","link":"https://medium.com/hyperjump-tech/get-notified-of-expiring-tls-ssl-certificates-with-neo-sense-dbbafa5329e1?source=rss----fabfd42372dc---4","guid":"https://medium.com/p/dbbafa5329e1","category":["monitoring","neo-sense","ssl","tls","monika"],"dc:creator":"Denny Pradipta","pubDate":"Wed, 25 Jan 2023 00:24:23 GMT","atom:updated":"2023-01-25T00:24:23.315Z","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*NGlrBJUmHxybPi6D\" /><figcaption>Photo by <a href=\"https://unsplash.com/es/@franckinjapan?utm_source=medium&utm_medium=referral\">Franck</a> on <a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\">Unsplash</a></figcaption></figure><p>When it comes to keeping websites secure, one of the most important things to do is to make sure that the Transport Layer Security (TLS) certificates don’t expire. TLS certificates provide an important layer of protection for websites and other web-based services, and if they expire, they can prevent visitors from accessing the sites.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/643/1*lrd7DHPm0bZahVNMWAuDOw.png\" /><figcaption>Example of expired SSL</figcaption></figure><p>Do you need to keep track of your TLS/SSL certificates but don’t know where to start? With <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>, you can easily monitor TLS/SSL certificates, ensuring that all certificates stay up-to-date and secure.</p><p>This article will show you how to monitor your TLS/SSL certificates using NEO Sense. So, without further ado:</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FxTiIzz6jXIbQ4R943K%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FxTiIzz6jXIbQ4R943K%2Fgiphy.gif&image=https%3A%2F%2Fi.giphy.com%2Fmedia%2FxTiIzz6jXIbQ4R943K%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"184\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/7798451b5b9c2829fb2ff12cf1c79ac8/href\">https://medium.com/media/7798451b5b9c2829fb2ff12cf1c79ac8/href</a></iframe><p>Meet <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a><strong>: </strong>The web application version of <a href=\"https://monika.hyperjump.tech/\">Monika</a>. It simplifies the use of Monika through an easy-to-use dashboard interface. It provides a graphical user interface for you to create probes, set alerts and notifications, and check the validity of your TLS/SSL certificates.</p><p>Using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>, you can probe your websites and endpoints from multiple locations. Below is the list of available locations currently:</p><ul><li>Jakarta, Indonesia</li><li>Banten, Indonesia</li><li>West Java, Indonesia</li><li>Singapore, Singapore</li><li>Tokyo, Japan</li><li>New Jersey, United States</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*RAQSVnf3bQbGNCAm.png\" /></figure><p>You can start using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a> by navigating to <a href=\"https://neosense.bgnlab.id/\">https://neosense.bgnlab.id</a> and creating an account. You will receive an email to confirm your account.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/546/0*EWc2QuObmpZ0ZH1s.png\" /></figure><p>After confirming your email, log in to the website, and you will be redirected to the <strong>Create Organization</strong> page. Fill out the organization details and click <strong>Create</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*S2EAEOkVlnJnAHmS.png\" /></figure><p>You will be redirected to the <strong>Create Project </strong>page. Set your first project name, and select your time zone. By default, it will automatically use your current time zone. Click <strong>Continue </strong>to go to the dashboard.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*JqaX82RGpGl0UU4O.png\" /></figure><p>In the dashboard, click the <strong>Add New Probe</strong> button. Then, fill out the probe details such as probe <strong>protocol</strong> (HTTP/TCP), <strong>name</strong>, <strong>URL</strong>, and <strong>description</strong>. Then, save the probe by clicking the <strong>Add New Probe </strong>button. Remember that to monitor TLS/SSL certificate status, <strong>you need to use HTTPS URL</strong>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*hVYVCotqN3gQROj-.png\" /></figure><p>Head to the <strong>Overview </strong>tab and scroll until you see the <strong>TLS Statuses </strong>section. You will see the current status of your TLS/SSL certificates and the expiry date. NEO Sense will notify you seven days and three days before your TLS/SSL certificates expire.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*CiWvnQUW09kNRp3JtL43xw.png\" /></figure><p>Congratulations! Now you can monitor how many days are left until your TLS/SSL certificates expired. It’s time to sit back, relax, and take the actions needed if your TLS/SSL certificates are going to expire soon.</p><h3>Closing</h3><p>In conclusion, <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a> is a valuable tool for developers looking to improve the performance of their website for a global audience. You won’t be embarrassed by small things such as expiring TLS/SSL certificates by monitoring your it using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>.</p><p>If you have questions or find issues while using <a href=\"https://neosense.bgnlab.id/\"><strong>NEO Sense</strong></a>, don’t hesitate to create an issue on <a href=\"https://github.com/hyperjumptech/monika/issues\">Monika’s Github Issue Page</a>. If you like this article, don’t forget to clap and share this article with your friends!</p><p>That’s it for today, see you next week!</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fgiphy.com%2Fembed%2FLVjJhHQXasrfi%2Ftwitter%2Fiframe&display_name=Giphy&url=https%3A%2F%2Fmedia.giphy.com%2Fmedia%2FLVjJhHQXasrfi%2Fgiphy.gif&image=https%3A%2F%2Fmedia1.giphy.com%2Fmedia%2Fv1.Y2lkPTc5MGI3NjExcXZhZ3Q1emlzb3d3eTVkcjE2NHMwaGV6dXZsejNvdnhwcXo5c2lycCZlcD12MV9naWZzX2dpZklkJmN0PWc%2FLVjJhHQXasrfi%2Fgiphy.gif&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=giphy\" width=\"435\" height=\"259\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/9af7a7071c2428d926676d59c116fa42/href\">https://medium.com/media/9af7a7071c2428d926676d59c116fa42/href</a></iframe><p><a href=\"https://hyperjump.tech/\">Hyperjump</a> is an open-source-first company providing engineering excellence service. We aim to build and commercialize <a href=\"https://github.com/hyperjumptech\">open-source tools</a> to help companies streamline, simplify, and secure the most important aspects of their modern DevOps practices.</p><p><a href=\"https://github.com/hyperjumptech\">Hyperjump</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=dbbafa5329e1\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/hyperjump-tech/get-notified-of-expiring-tls-ssl-certificates-with-neo-sense-dbbafa5329e1\">Get notified of expiring TLS/SSL certificates with NEO Sense</a> was originally published in <a href=\"https://medium.com/hyperjump-tech\">Hyperjump Tech</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"}]},"__N_SSG":true}